import {Config} from "../Config"

export const intros = [
    {
        text: `🦉Я <b>Сова</b>, твой внутренний помощник
Не знаю как это работает,
просто слушай меня и все будет ОК
Пойдем посмотрим, что тут происходит`,
        button: `Давай посмотрим`
    },
    {
        text: `

🦉Ты попал в необычное место

Мир <b>Великой Спирали</b>

Его еще называют Лимилэнд

Здесь все логично и нелогично одновременно

Скоро ты окажешься в Зерограде,
Это город, от которого идет отсчет твоего <b>Пути</b>

А Путь, дорогой мой, это не хухры-мухры
У каждого должен быть Путь, обязательно!
<i>Вот теперь и у тебя он есть</i>


`,
        button: `Хорошо`
    },
    {
        text: `🦉Мой хороший,
посмотрим на твои характеристики   
<code>
⚔️3 🛡0  ❤️15  🔋3
</code>
⚔️ - атака
🛡 - броня
❤️ - здоровье (HP)
🔋 - действие (AP)

Если давно не играл в игрушки, то напомню,
<b>HP</b> = Health Points = Очки здоровья
<b>AP</b> = Action Points = Очки действия
        
`,
        button: `Хочу качаться`
    },
    {
        text: `🦉Вот это правильно!
Качаться, качаться и еще раз качаться
Каждый день
Тем более у тебя же есть Путь!
Чем сильнее ты будешь, тем больше пройдешь
Ну и люлей врагам больше выдашь
<b>Ну как? Готов?</b>
`,
        button: `Всегда готов!`
    },

    {
        text: `🦉Основной ресурс - это чипы 🧩
Да, да. Без чипов никуда, хочешь стать сильнее,
Тогда добывай, собирай, находи, отбирай чипы

Но если особенно повезет, то сможешь получить лими 💎
Это самое дорогое что есть в Лимилэнде        
`,
        button: `Понятно`
    },

    {
        text: `🦉А ты мне уже нравишься!
Получи приветственный бонус от Совы
<b>+ 5🧩</b>
<b>+ 2💎</b>

Только расписаться в бланке не забудь 
`,
        button: `Расписаться`
    },
    {
        text: `Ну все,
ты готов
Отправляю тебя в 🌐Зероград
Абра-кадабра!
`,
        button: `🌐В Зероград`
    }
]
